7767517
50 56
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 9=1
Convolution              convrelu_1               1 1 1 2 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728 9=1
Pooling                  avgpool2d_14             1 1 2 3 0=1 1=2 11=2 12=2 13=0 2=2 3=0 5=1 6=1
Convolution              convrelu_2               1 1 3 4 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=1
Pooling                  avgpool2d_15             1 1 4 5 0=1 1=2 11=2 12=2 13=0 2=2 3=0 5=1 6=1
Convolution              conv_25                  1 1 5 6 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Reshape                  view_39                  1 1 6 7 0=64 1=64 11=16 2=32
Split                    splitncnn_0              1 2 7 8 9
BatchNorm                bn_16                    1 1 9 10 0=32 1=1.000000e-05
ReLU                     relu_2                   1 1 10 11
Convolution3D            conv3d_26                1 1 11 12 0=32 1=3 11=3 12=1 13=1 14=1 2=1 21=3 22=1 23=1 24=1 3=1 4=1 5=1 6=27648
ReLU                     relu_3                   1 1 12 13
Convolution3D            conv3d_27                1 1 13 14 0=32 1=3 11=3 12=1 13=1 14=1 2=1 21=3 22=1 23=1 24=1 3=1 4=1 5=1 6=27648
BinaryOp                 add_0                    2 1 14 8 15 0=0
Split                    splitncnn_1              1 2 15 16 17
BatchNorm                bn_17                    1 1 17 18 0=32 1=1.000000e-05
ReLU                     relu_4                   1 1 18 19
Convolution3D            conv3d_28                1 1 19 20 0=32 1=3 11=3 12=1 13=1 14=1 2=1 21=3 22=1 23=1 24=1 3=1 4=1 5=1 6=27648
ReLU                     relu_5                   1 1 20 21
Convolution3D            conv3d_29                1 1 21 22 0=32 1=3 11=3 12=1 13=1 14=1 2=1 21=3 22=1 23=1 24=1 3=1 4=1 5=1 6=27648
BinaryOp                 add_1                    2 1 22 16 23 0=0
Split                    splitncnn_2              1 2 23 24 25
BatchNorm                bn_18                    1 1 25 26 0=32 1=1.000000e-05
ReLU                     relu_6                   1 1 26 27
Convolution3D            conv3d_30                1 1 27 28 0=32 1=3 11=3 12=1 13=1 14=1 2=1 21=3 22=1 23=1 24=1 3=1 4=1 5=1 6=27648
ReLU                     relu_7                   1 1 28 29
Convolution3D            conv3d_31                1 1 29 30 0=32 1=3 11=3 12=1 13=1 14=1 2=1 21=3 22=1 23=1 24=1 3=1 4=1 5=1 6=27648
BinaryOp                 add_2                    2 1 30 24 31 0=0
Split                    splitncnn_3              1 2 31 32 33
BatchNorm                bn_19                    1 1 33 34 0=32 1=1.000000e-05
ReLU                     relu_8                   1 1 34 35
Convolution3D            conv3d_32                1 1 35 36 0=32 1=3 11=3 12=1 13=1 14=1 2=1 21=3 22=1 23=1 24=1 3=1 4=1 5=1 6=27648
ReLU                     relu_9                   1 1 36 37
Convolution3D            conv3d_33                1 1 37 38 0=32 1=3 11=3 12=1 13=1 14=1 2=1 21=3 22=1 23=1 24=1 3=1 4=1 5=1 6=27648
BinaryOp                 add_3                    2 1 38 32 39 0=0
Split                    splitncnn_4              1 2 39 40 41
BatchNorm                bn_20                    1 1 41 42 0=32 1=1.000000e-05
ReLU                     relu_10                  1 1 42 43
Convolution3D            conv3d_34                1 1 43 44 0=32 1=3 11=3 12=1 13=1 14=1 2=1 21=3 22=1 23=1 24=1 3=1 4=1 5=1 6=27648
ReLU                     relu_11                  1 1 44 45
Convolution3D            conv3d_35                1 1 45 46 0=32 1=3 11=3 12=1 13=1 14=1 2=1 21=3 22=1 23=1 24=1 3=1 4=1 5=1 6=27648
BinaryOp                 add_4                    2 1 46 40 47 0=0
Split                    splitncnn_5              1 2 47 48 49
BatchNorm                bn_21                    1 1 49 50 0=32 1=1.000000e-05
ReLU                     relu_12                  1 1 50 51
Convolution3D            conv3d_36                1 1 51 52 0=32 1=3 11=3 12=1 13=1 14=1 2=1 21=3 22=1 23=1 24=1 3=1 4=1 5=1 6=27648
ReLU                     relu_13                  1 1 52 53
Convolution3D            conv3d_37                1 1 53 54 0=32 1=3 11=3 12=1 13=1 14=1 2=1 21=3 22=1 23=1 24=1 3=1 4=1 5=1 6=27648
BinaryOp                 add_5                    2 1 54 48 out0 0=0
